In [145]:
# import pandas as pd
'''for converting excel file into csv'''
# excel_data  = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx')
# excel_data.to_csv('req_data.csv', index=False)

'for converting excel file into csv'

In [146]:
import pandas as pd
excel_file  = pd.ExcelFile('KPMG_VI_New_raw_data_update_final.xlsx')

for sheet in excel_file.sheet_names:
    df =  pd.read_excel(excel_file, sheet_name= sheet)
    csv_file = f'{sheet}.csv'
    df.to_csv(csv_file,index=False)

## Customer Address Data

In [147]:
customerAddress_df = pd.read_csv('CustomerAddress.csv')
customerAddress_df.head(5)

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,customer_id,address,postcode,state,country,property_valuation
1,1,060 Morning Avenue,2016,New South Wales,Australia,10
2,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
3,4,0 Holy Cross Court,4211,QLD,Australia,9
4,5,17979 Del Mar Point,2448,New South Wales,Australia,4

In [148]:
customerAddress_df.head(4)

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,customer_id,address,postcode,state,country,property_valuation
1,1,060 Morning Avenue,2016,New South Wales,Australia,10
2,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
3,4,0 Holy Cross Court,4211,QLD,Australia,9

In [168]:
customerAddress_df = customerAddress_df.T

new_cols  = customerAddress_df.iloc[0]
customerAddress_df = customerAddress_df[1:]
customerAddress_df.columns = new_cols

customerAddress_df = customerAddress_df.reset_index(drop=True)

In [169]:
customerAddress_df.columns

Index(['address', 'postcode', 'state', 'country', 'property_valuation'], dtype='object', name='customer_id')

In [151]:
customerAddress_df.size

24000

In [152]:
customerAddress_df.shape

(6, 4000)

In [153]:
customerAddress_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Columns: 4000 entries, customer_id to 4003
dtypes: object(4000)
memory usage: 187.6+ KB

In [164]:
customerAddress_df.head(4)

customer_id,customer_id,address,postcode,state,country,property_valuation
0,customer_id,address,postcode,state,country,property_valuation
1,1,060 Morning Avenue,2016,New South Wales,Australia,10
2,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
3,4,0 Holy Cross Court,4211,QLD,Australia,9

In [170]:
customerAddress_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   address             3999 non-null   object
 1   postcode            3999 non-null   object
 2   state               3999 non-null   object
 3   country             3999 non-null   object
 4   property_valuation  3999 non-null   object
dtypes: object(5)
memory usage: 156.3+ KB

In [171]:
customerAddress_df = customerAddress_df.drop_duplicates()
customerAddress_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   address             3999 non-null   object
 1   postcode            3999 non-null   object
 2   state               3999 non-null   object
 3   country             3999 non-null   object
 4   property_valuation  3999 non-null   object
dtypes: object(5)
memory usage: 156.3+ KB

## traTra